const Tos = () => {
    return(
    <div className="Tos">
    <div className="tos_title">
        <h1>WalletStory 이용약관</h1>
    </div>
    <div className="tos_purpose">
        <h2>제 1조 (목적)</h2>
        <p>이 약관은 WalletStory(이하 "서비스")의 이용과 관련하여 회시와 회원 간의 권리, 의무 및 책임 사항, 기타<br/>
        필요한 사항을 규정함을 목적으로 합니다.
        </p>
    </div>
    <div className="tos_definition">
        <h2>제 2조 (정의)</h2>
        <ol>
        <li>"회원" 이라 함은 본 약관에 동의하고 서비스를 이용하는 개인을 말합니다.</li>
        <li>"서비스"라 함은 사용자가 수입ㆍ지출 내역을 기록ㆍ관리하고,커뮤니티를 통해 정보를 공유할 수 있는 가계부 플랫폼을 말합니다.</li>
        <li>"콘텐츠"라 함은 회원이 서비스를 이용하면서 업로드하거나 작성한 텍스트, 이미지, 기타 정보를 말합니다.</li>
        </ol>
    </div>
    <div className="tos_effect">
        <h2>제 3조 (약관의 효력 및 변경)</h2>
        <ol>
        <li>본 약관은 서비스를 이용하는 모든 회원에게 적용됩니다.</li>
        <li>회사는 관련 법령을 위반하지 않는 범위 내에서 약관을 변경할 수 있습니다.</li>
        <li>변경된 약관은 서비스 내 공지사항을 통해 고지하며, 회원이 7일 이내에 이의를 제기하지 않을 경우 동의한 것으로 간주합니다. </li>
        </ol>
    </div>
    <div className="tos_management">
    <h2>제 4조 (회원 가입 및 관리)</h2>
    <ol>
    <li>회원 가입은 본 약관에 동의하고, 서비스가 요구하는 정보를 기재하여 이용 신청을 함으로써 성립됩니다.</li>
    <li>회원은 본인의 정보가 변경될 즉시 수정해야 하며, 허위 정보를 제공 해서는 안됩니다.</li>
    <li>회사는 다음 각 호에 해당하는 경우 회원 가입을 거부하거나 해지할 수 있습니다.
        <ul>
        <li>타인의 정보를 도용한 경우</li>
        <li>법령 또는 공공질서에 위반되는 행위를 한 경우</li>
        <li>서비스 운영을 고의로 방해한 경우</li>
        </ul>
    </li>
    </ol>
    </div>
    <div className="tos_service">
    <h2>제 5조 (서비스 이용)</h2>
    <ol>
    <li>회원은 서비스를 통해 수입ㆍ지출 관리, 예산설정 등을 할 수 있습니다.</li>
    <li>회사는 서비스 개선 및 안정적인 제공을 위해 필요 시 일시적으로 서비스 제공을 중단할 수 있습니다.</li>
    <li>회원의 데이터는 보관 정책에 따라 관리되며, 장기간 미사용 계정은 별도의 고지 후 삭제될 수 있습니다.</li>
    </ol>
    </div>
    <div className="tos_protection">
    <h2>제 6조 (개인정보 보호)</h2>
    <ol>
    <li>회사는 관련 법령에 따라 회원의 개인정보를 보호하며, 개인정보 처리 방침을 따릅니다.</li>
    <li>회원은 본인의 계정 정보(아이디, 비밀번호 등)를 제 3자에게 제공해서는 안됩니다.</li>
    </ol>
    </div>
    <div className="tos_duty">
    <h2>제 7조 (회원의 의무)</h2>
    <ol>
    <li>회원은 법령, 약관, 서비스 이용 안내 및 주의사항을 준수해야 합니다.</li>
    <li>회원은 다음 행위를 하여서는 안됩니다.
        <ul >
        <li>타인의 계정 정보 도용</li>
        <li>회사 및 제 3자의 권리를 침해하는 행위</li>
        <li>서비스 운영을 방해하는 행위</li>
        </ul>
    </li>
    </ol>
    </div>
    <div className="tos_limit">
    <h2>제 8조 (책임 제한)</h2>
    <ol>
    <li>회사는 천재지변, 시스템 장애 등 불가항력적인 사유로 인한 서비스 중단에 대해 책임을 지지 않습니다.</li>
    <li>회사는 회원 간 거래, 분쟁 등에서 발생하는 문제에 대해 개입하지 않으며 책임을 지지 않습니다.</li>
    </ol>
    </div>
    <div className="tos_cancel">
    <h2>제 9조 (계약 해지 및 이용제한)</h2>
    <ol>
    <li>회원은 언제든지 서비스 내 설정을 통해 회원 탈퇴를 신청할 수 있습니다.</li>
    <li>회사는 회원이 본 약관을 위반한 경우 사전 통보 후 서비스 이용을 제한하거나 계정을 삭제할 수 있습니다</li>
    </ol>
    </div>
    <div className="tos_trial">
    <h2>제 10조 (준거법 및 재판 관할)</h2>
    <p>본 약관과 관련된 분쟁은 대한민국 법을 준거법으로 하며, 관할 법원은 회사 소재지를 관할하는 법원으로 합니다.</p>
    </div>
    </div>
    )
}

export default Tos;